class_names =  ['negative', 'positive']
       total files =  9 , going to load total_load =  5
total files =  9 , going to load total_load =  5
   get_sample_dimensions: 11.wav.npz: melgram.shape =  (1, 96, 13546, 2)
 melgram dimensions:  (1, 96, 13546, 2)

 Loading class 1/2: 'negative', File 5/5: Preproc/Test/negative/21.wav.npz                  
class names =  ['negative', 'positive']
2
 MyCNN_Keras2: X_shape =  (5, 96, 13546, 2) , channels =  2
Looking for previous weights...
Weights file detected. Loading from  weights.hdf5
 Available GPUs =  [] , count =  0
Summary of serial model (duplicated across 0 GPUs):
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input (Conv2D)               (None, 94, 13544, 32)     608       
_________________________________________________________________
batch_normalization_3 (Batch (None, 94, 13544, 32)     376       
_________________________________________________________________
activation_11 (Activation)   (None, 94, 13544, 32)     0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 92, 13542, 32)     9248      
_________________________________________________________________
activation_12 (Activation)   (None, 92, 13542, 32)     0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 46, 6771, 32)      0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 46, 6771, 32)      0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 44, 6769, 32)      9248      
_________________________________________________________________
activation_13 (Activation)   (None, 44, 6769, 32)      0         
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 22, 3384, 32)      0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 22, 3384, 32)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 20, 3382, 32)      9248      
_________________________________________________________________
activation_14 (Activation)   (None, 20, 3382, 32)      0         
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 10, 1691, 32)      0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 10, 1691, 32)      0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 541120)            0         
_________________________________________________________________
dense_5 (Dense)              (None, 128)               69263488  
_________________________________________________________________
activation_15 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 2)                 258       
_________________________________________________________________
Output (Activation)          (None, 2)                 0         
=================================================================
Total params: 69,292,474
Trainable params: 69,292,286
Non-trainable params: 188
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Input (Conv2D)               (None, 94, 13544, 32)     608       
_________________________________________________________________
batch_normalization_3 (Batch (None, 94, 13544, 32)     376       
_________________________________________________________________
activation_11 (Activation)   (None, 94, 13544, 32)     0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 92, 13542, 32)     9248      
_________________________________________________________________
activation_12 (Activation)   (None, 92, 13542, 32)     0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 46, 6771, 32)      0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 46, 6771, 32)      0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 44, 6769, 32)      9248      
_________________________________________________________________
activation_13 (Activation)   (None, 44, 6769, 32)      0         
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 22, 3384, 32)      0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 22, 3384, 32)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 20, 3382, 32)      9248      
_________________________________________________________________
activation_14 (Activation)   (None, 20, 3382, 32)      0         
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 10, 1691, 32)      0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 10, 1691, 32)      0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 541120)            0         
_________________________________________________________________
dense_5 (Dense)              (None, 128)               69263488  
_________________________________________________________________
activation_15 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 2)                 258       
_________________________________________________________________
Output (Activation)          (None, 2)                 0         
=================================================================
Total params: 69,292,474
Trainable params: 69,292,286
Non-trainable params: 188
_________________________________________________________________
Running predict...
Counting mistakes 
    Found 0 total mistakes out of 5 attempts
      Mistakes by class: 
          class 'negative': 0
          class 'positive': 0
Running model.evaluate...
5/5 [==============================] - 35s 7s/step
Test loss: 0.009356791153550148
Test accuracy: 1.0
All model scores:
['loss', 'acc']
[0.009356791153550148, 1.0]

Finished.